
&НаСервере
Процедура РольНачалоВыбораНаСервере()	
	Роли = Метаданные.Роли;
	МассивРолей = Новый Массив;
	Для Каждого Роль Из Роли Цикл
		МассивРолей.Добавить(Роль.Синоним);	
	КонецЦикла; 		
	Элементы.Роль.СписокВыбора.ЗагрузитьЗначения(МассивРолей);
КонецПроцедуры

&НаКлиенте
Процедура РольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	РольНачалоВыбораНаСервере();		
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента",ЭтотОбъект);
	Элементы.Роль.СписокВыбора.ПоказатьВыборЭлемента(Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(Элемент, СписокПараметров) Экспорт
	Роль = Объект.Роль;
	Если Элемент = Неопределено Тогда
		Если Роль = "" Тогда
			Сообщить("Не выбрано значение");
		Иначе 
			Объект.Роль = Роль; 	
		КонецЕсли;
	Иначе
		Объект.Роль = Элемент.Значение;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РольОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.Роль = ВыбранноеЗначение;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Роль = "" Тогда
		Сообщить("Роль не выбрана.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры