Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если не ПустаяСтрока(Наименование) Тогда 
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		Если Пользователь = Неопределено Тогда 
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользователь.Имя = Наименование;
			НовыйПользователь.ПолноеИмя = Наименование;
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль));
			НовыйПользователь.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры